
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Расчитатьстоимость(ТекущаяСтрока);

КонецПроцедуры


&НаКлиенте
Процедура Расчитатьстоимость(ТекущаяСтрока) 
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
Конецпроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Расчитатьстоимость(ТекущаяСтрока);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьАкцию(ТекущаяДата());
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАкцию(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ 
	                |	Акции.Ссылка
	                |ИЗ
	                |	Справочник.Акции КАК Акции
	                |ГДЕ
	                |	Акции.ДатаНачала <= &ДатаДокумента
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Акции.ДатаНачала УБЫВ" ;
	Запрос.УстановитьПараметр("ДатаДокумента",НачалоДня(Дата));				
	Результат = Запрос.Выполнить();				
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.Акция = Выборка.Ссылка;		
	КонецЕсли;	
		     	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
		ЗаполнитьАкцию(Объект.Дата);
КонецПроцедуры

