
&НаКлиенте
Процедура РасчитатьСебестоимость(Команда)
	Если ПериодРасчета = Дата(1, 1, 1) Тогда
		ПериодРасчета = КонецМесяца(ТекущаяДата());
	КонецЕсли;	
		
	РасчитатьСебестоимостьНаСервере();
КонецПроцедуры

&НаСервере
Процедура РасчитатьСебестоимостьНаСервере()
	РасчитатьСебестоимостьПоФифо();
	РасчитатьПремию();
КонецПроцедуры

&НаСервере
Процедура РасчитатьСебестоимостьПоФифо();
//TODO Сосновый А.С.
//Не плохо бы написать расчет
	
КонецПроцедуры


&НаСервере
Процедура РасчитатьПремию()
	
	ОчиститьСтарыЗаписиПоПремии();
	
	ЗапросПоПреми = Новый Запрос;
	ЗапросПоПреми.Текст = "ВЫБРАТЬ
	                |	СУММА(ПродажиПоАкциямОбороты.СтоимостьОборот) КАК СтоимостьОборот,
	                |	ПродажиПоАкциямОбороты.Продавец
	                |ПОМЕСТИТЬ ВтПродажиСотрудника
	                |ИЗ
	                |	РегистрНакопления.ПродажиПоАкциям.Обороты(&НачалоМесяца, &КонецМесяца, Месяц, ) КАК ПродажиПоАкциямОбороты
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПродажиПоАкциямОбороты.Продавец
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ПланПродажСрезПоследних.Сотрудник,
	                |	ПланПродажСрезПоследних.ПланПродаж
	                |ПОМЕСТИТЬ ВтПлан
	                |ИЗ
	                |	РегистрСведений.ПланПродаж.СрезПоследних(&КонецМесяца, ) КАК ПланПродажСрезПоследних
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВтПродажиСотрудника.Продавец,
	                |	ВтПродажиСотрудника.СтоимостьОборот
	                |ИЗ
	                |	ВтПродажиСотрудника КАК ВтПродажиСотрудника
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтПлан КАК ВтПлан
	                |		ПО ВтПродажиСотрудника.Продавец = ВтПлан.Сотрудник
	                |			И ВтПродажиСотрудника.СтоимостьОборот >= ВтПлан.ПланПродаж";
	ЗапросПоПреми.УстановитьПараметр("НачалоМесяца",НачалоМесяца(ПериодРасчета));
	ЗапросПоПреми.УстановитьПараметр("КонецМесяца",КонецМесяца(ПериодРасчета));
	ВыборкаПОПеремии =  ЗапросПоПреми.Выполнить().Выбрать();
	
	Пока ВыборкаПОПеремии.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПремииСотрудников.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Сотрудник = ВыборкаПОПеремии.Продавец;
		МенеджерЗаписи.Премия 	 = ВыборкаПОПеремии.СтоимостьОборот * Объект.ПроцентПремии/100;
		МенеджерЗаписи.Период 	 = КонецМесяца(ПериодРасчета);
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла;	
					
	
КонецПроцедуры	

&НаСервере
Процедура ОчиститьСтарыЗаписиПоПремии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПремииСотрудниковСрезПоследних.Сотрудник,
	               |	ПремииСотрудниковСрезПоследних.Премия,
	               |	ПремииСотрудниковСрезПоследних.Период
	               |ИЗ
	               |	РегистрСведений.ПремииСотрудников.СрезПоследних(&ДатаРасчета, ) КАК ПремииСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("ДатаРасчета",КонецМесяца(ПериодРасчета));			   
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.ПремииСотрудников.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник); 
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период); 
		НаборЗаписей.Записать();	
		
	КонецЦикла;	
		
КонецПроцедуры