Процедура ПроверитьИСоздатьАдминистратора(ТребуетсяПерезапуск = Ложь) Экспорт
	
УстановитьПривилегированныйРежим (Истина);

Если НЕ Константы.АдминистраторСоздан.Получить() Тогда

	ПользовательАдминистратор = ПользователиИнформационнойБазы.НайтиПоИмени("Администратор"); 
	Если ПользовательАдминистратор = Неопределено Тогда
	
		ПользовательАдминистратор 			= ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательАдминистратор.Имя 		= "Администратор";
		ПользовательАдминистратор.ПолноеИмя = "Администратор";
		ПользовательАдминистратор.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		ПользовательАдминистратор.Записать();
		ТребуетсяПерезапуск = Истина;	
		Константы.АдминистраторСоздан.Установить(Истина);
	КонецЕсли;
КонецЕсли;
УстановитьПривилегированныйРежим (Ложь);	
	
КонецПроцедуры	

/// #20 Конфигурация разложена на исходники