//начало текста модуля

#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"СоздаетсяЭлементСправочникаСНаименованием(Парам01,Парам02)","СоздаетсяЭлементСправочникаСНаименованием","Тогда Создается элемент справочника ""Акции"" с наименованием 'ПерваяАкция'");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Тогда Создается элемент справочника "Акции" с наименованием 'ПерваяАкция'
//@СоздаетсяЭлементСправочникаСНаименованием(Парам01,Парам02)
Процедура СоздаетсяЭлементСправочникаСНаименованием(НаименованиеСправочника,НаименованиеЭлемента) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Если НЕ АсертЭлементСправочникаСуществует(НаименованиеСправочника,НаименованиеЭлемента) Тогда 
		ТекстИсключения =  "Элемент "+НаименованиеЭлемента+" справочника "+НаименованиеСправочника+" НЕ Существует!";
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;	

КонецПроцедуры


&НаСервере
Функция  АсертЭлементСправочникаСуществует(НаименованиеСправочника,НаименованиеЭлемента)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	НужныйСправочник.Ссылка
	                |ИЗ
	                |	Справочник."+НаименованиеСправочника+" КАК НужныйСправочник
	                |ГДЕ
	                |	НужныйСправочник.Наименование = &Наименование" ;
					
	Запрос.УстановитьПараметр("Наименование",НаименованиеЭлемента);
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции	


//окончание текста модуля