//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДанныеОПродажеСохраняютсяВ1с()","ДанныеОПродажеСохраняютсяВ1с","Тогда данные о продаже сохраняются в 1с");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕщеНетНиОдногоДокумента(Парам01)","ЕщеНетНиОдногоДокумента","И еще нет ни одного документа ""Продажа""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"СозданДокументСНомером(Парам01,Парам02)","СозданДокументСНомером","Тогда создан документ ""Продажа"" с номером ""000000001""");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//И еще нет ни одного документа "Продажа"
//@ЕщеНетНиОдногоДокумента(Парам01)
Процедура ЕщеНетНиОдногоДокумента(ИмяДокумента) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
	УдалитьВсеДокументы(ИмяДокумента);
КонецПроцедуры


&НаСервере
Процедура УдалитьВсеДокументы(ИмяДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст  = "ВЫБРАТЬ
	                |	"+ИмяДокумента+".Ссылка
	                |ИЗ
	                |	Документ."+ИмяДокумента+" КАК "+ИмяДокумента;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры	
//окончание текста модуля

&НаКлиенте
//Тогда создан документ "Продажа" с номером "000000001"
//@СозданДокументСНомером(Парам01,Парам02)
Процедура СозданДокументСНомером(ИмяДокумента,НомерДокумента) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	СсылкаНадокумент = НайтиДокументыНаСервере(ИмяДокумента,НомерДокумента);	
	Если СсылкаНадокумент = Неопределено Тогда
		ВызватьИсключение "Не найден документ " + ИмяДокумента + " " + НомерДокумента;
	КонецЕсли;	
КонецПроцедуры



&НаСервере
Функция НайтиДокументыНаСервере(ИмяДокумента,НомерДокумента) 
	
	 Возврат Документы[ИмяДокумента].НайтиПоНомеру(НомерДокумента,ТекущаяДата());
	 
КонецФункции	


